-- 1 запрос --

SELECT
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_СЕССИЯ.ЧЛВК_ИД
FROM
    Н_ЛЮДИ
RIGHT JOIN
    Н_СЕССИЯ ON Н_ЛЮДИ.ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE
    Н_ЛЮДИ.ФАМИЛИЯ = 'Афанасьев'
    AND Н_СЕССИЯ.УЧГОД < '2001/2002';

-- 2 запрос --

SELECT
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ВЕДОМОСТИ.ДАТА,
    Н_СЕССИЯ.ИД
FROM
    Н_ЛЮДИ
INNER JOIN
    Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
INNER JOIN
    Н_СЕССИЯ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_СЕССИЯ.ЧЛВК_ИД
WHERE
    Н_ЛЮДИ.ФАМИЛИЯ < 'Петров'
    AND Н_ВЕДОМОСТИ.ДАТА = '2010-06-18'
    AND Н_СЕССИЯ.ЧЛВК_ИД > 126631;

-- 3 запрос --

SELECT CASE WHEN 
(
SELECT
    COUNT(Н_ЛЮДИ.ИД)
FROM 
    Н_ЛЮДИ
JOIN 
    Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN 
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ВИД_ОБУЧ_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE 
    (Н_ЛЮДИ.ИНН IS NULL OR Н_ЛЮДИ.ИНН = '')
    AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очно-заочная(вечерняя)'
    AND (Н_УЧЕНИКИ.КОНЕЦ IS NULL OR Н_УЧЕНИКИ.КОНЕЦ > CURRENT_DATE)
) = 0
THEN
    'no'
ELSE
    'yes'
END;

-- 4 запрос --

SELECT 
    Н_ЛЮДИ.ИМЯ,
    COUNT(Н_ЛЮДИ.ИД) AS количество_студентов
FROM 
    Н_ЛЮДИ
JOIN 
    Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN 
    Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ВИД_ОБУЧ_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
WHERE 
    Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Заочная'
GROUP BY 
    Н_ЛЮДИ.ИМЯ
HAVING 
    COUNT(Н_ЛЮДИ.ИД) > 50;

-- 5 запрос --

SELECT 
    УЧЕНИКИ,
    ФИО,
    СРЕДНЯЯ_ОЦЕНКА
FROM
(
    SELECT
        Н_УЧЕНИКИ.ИД AS УЧЕНИКИ,
        CONCAT(Н_ЛЮДИ.ФАМИЛИЯ, ' ', Н_ЛЮДИ.ИМЯ, ' ', Н_ЛЮДИ.ОТЧЕСТВО) AS ФИО,
        AVG(ОЦЕНКА::INTEGER) AS СРЕДНЯЯ_ОЦЕНКА,
        Н_УЧЕНИКИ.ГРУППА AS ГРУППА_УЧЕНИКА
    FROM
        Н_УЧЕНИКИ
    JOIN Н_ОБУЧЕНИЯ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    JOIN Н_ЛЮДИ ON Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
    JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    AND ОЦЕНКА IN ('5', '4', '3', '2')
    GROUP BY
        Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.ГРУППА
    HAVING
        Н_УЧЕНИКИ.ГРУППА = '4100'
)
WHERE
    СРЕДНЯЯ_ОЦЕНКА = (
    SELECT
        MIN(ОЦЕНКА::INTEGER)
    FROM
        Н_УЧЕНИКИ
    JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
    AND ОЦЕНКА IN ('5', '4', '3', '2')
    GROUP BY
        Н_УЧЕНИКИ.ГРУППА
    HAVING
        Н_УЧЕНИКИ.ГРУППА = '1101'
);

-- 6 запрос --

SELECT
    Н_УЧЕНИКИ.ГРУППА AS "Номер группы",
    Н_УЧЕНИКИ.ЧЛВК_ИД AS "Номер студента",
    Н_ЛЮДИ.ФАМИЛИЯ AS "Фамилия",
    Н_ЛЮДИ.ИМЯ AS "Имя",
    Н_ЛЮДИ.ОТЧЕСТВО AS "Отчество",
    Н_УЧЕНИКИ.П_ПРКОК_ИД AS "Номер пункта приказа"
FROM
    Н_УЧЕНИКИ
JOIN
    Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД
WHERE
    DATE(Н_УЧЕНИКИ.КОНЕЦ) = '2012-09-01'
    AND EXISTS (
        SELECT 1
        FROM Н_ОБУЧЕНИЯ
        JOIN Н_ФОРМЫ_ОБУЧЕНИЯ ON Н_ОБУЧЕНИЯ.ВИД_ОБУЧ_ИД = Н_ФОРМЫ_ОБУЧЕНИЯ.ИД
        WHERE 
            Н_ОБУЧЕНИЯ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
            AND Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ IN ('Очная', 'Заочная')
    )
ORDER BY
    Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО;

-- 7 запрос --

SELECT 
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО,
    Н_ЛЮДИ.ИД
FROM 
    Н_ЛЮДИ
WHERE 
    Н_ЛЮДИ.ФАМИЛИЯ IN (
        SELECT ФАМИЛИЯ
        FROM Н_ЛЮДИ
        GROUP BY ФАМИЛИЯ
        HAVING COUNT(ИД) > 1
    )
ORDER BY 
    Н_ЛЮДИ.ФАМИЛИЯ,
    Н_ЛЮДИ.ИМЯ,
    Н_ЛЮДИ.ОТЧЕСТВО;
